{
"About": {
  "Name": "Kamile Vaicekonis",
  "Currently": "Computer Science Student",
  "Headshot": "id-photo.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "My name is Kamile Vaicekonis, I am studying Computer Science at Seattle Pacific Unversity. I've always enjoyed solving puzzles and playing strategy games. I took a programming class at SPU and realized that my enjoyment for solving puzzles could be directly transferred into programming. Since then, I have been passionate about coding and excited to learn more as I work on my degree."
},
"Contact": {
  "EMail": "vaicekonisk@spu.edu",
  "Phone": "",
  "Portfolio": "https://www.github.com",
  "LinkedIn": "https://www.linkedin.com/in/kamile-v/",
  "GitHub": "https://github.com/kamile-v"
},
"Experience": {
  "ExperienceText": "Currently, I am studying at Seattle Pacific University with the goal of getting my BS in Computer Science.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2025",
  "EducationText": "",
  "Employment": "Seattle Pacific University",
  "Role": "",
  "EmploymentText": "",
  "Skills": ["C++", " JavaScript", " CSS"," HTML", "Go", "Prolog"],
  "SkillsText": "",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "PlannerBird - System Specification",
    "Desc": "This is an assignment that I completed for CSC3150 Systems Design.<br>This project goes over the software product's design requirements for developers.<br>PlannerBird is a mobile application that helps users organize trip plans.<br>The application also has a built in search suggestion functionality that recommends destinations based on user preferences.<br>It has a GitHub repo which is linked below.",
    "GitHubRepo": "https://github.com/kamile-v/System-Specification.git",
    "MainImage": "P1-photo.png",
    "DetailImages": ["P1-photo.png"]
  },
  "Project2": {
    "Title": "Lexical and Syntax Analyzer in Go",
    "Desc": "This was an individual assignment for Concepts in Programming, where I created a lexical and syntax analyzer in Go.<br>In this project, I learned to tokenize a programming language, parse it to make sure the syntax is correct, and output it in Scheme and Prolog.<br>Image: https://www.tutorialspoint.com/compiler_design/compiler_design_syntax_analysis.htm",
    "GitHubRepo": "https://github.com/csc3310-fall2024/go-parser-kamile-v",
    "MainImage": "syntax_analyzer.jpg",
    "DetailImages": []
  },
  "Project3": {
    "Title": "CapSource",
    "Desc": "CapSource is a crowdsourced caption correction extension for Panopto captions. This project is a team project for the Senior Capstone course sequence for my Bachelor's degree.<br>My role in the project was to work on the frontend development of the web app, where the user is able to log in and update corrections for their video by approving or rejecting submissions from video viewers.<br>While working on this project, I learned: AWS, JavaScript, TypeScript, and React. I was new to these and was excited to learn these ommonly used tools and languages.<br>Because this is a team project, I learned to communicate effectively with my team and encouraged teamwork by checking in with my teammates fequently regarding their progress.<br>One problem that we are still navigating with this project is that we are unable to modify the captions directly through our extension.<br>My idea for improving this problem would be to not modify the captions directly, but encourage viewers to install the extension so that only users that have the extension installed have the corrected version of the captions for videos.<br>There is no need to directly modify and save corrected captions within Panopto, or whichever viewing platform is being used. Instead, it's only necessary for the extension to display its own corrected script as the caption for the video.",
    "GitHubRepo": "https://github.com/SPU-CapSource",
    "MainImage": "CapSource Logo 2.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "C++ Certified Associate Programmer",
    "Desc": "Currently, I am working on getting my certification for C++. I am excited to get the certification and prove my expertise in C++ programming!<br>Image: https://medium.com/codex/why-youre-thinking-about-c-in-the-wrong-way-68c0f5dde0b0",
    "GitHubRepo": "",
    "MainImage": "Cpp.png",
    "DetailImages": []
  }
}
